Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/transport_and_disability/mobility_training_for_people_with_a_visual_impairment.html.txt.tmx
Source language: en
Languages: ga

source: Mobility training for people with visual impairments
ga: Oiliúint Soghluaiseachta do dhaoine ar a bhfuil lagú amhairc

source: Orientation and mobility training is of crucial importance to many people with vision impairments
ga: Baineann ríthábhacht le treoshuíomh agus le hoiliúint soghluaiseachta i measc go leor daoine ar a bhfuil lagú amhairc

source: Mobility training helps to develop skills required to move around safely in the environment
ga: Cabhraíonn oiliúint soghluaiseachta chun na scileanna a fhorbairt a theastaíonn chun siúl thart go sábháilte i dtimpeallacht

source: Some people with vision impairments have enough residual vision to move around independently
ga: Tá ag roinnt daoine ar a bhfuil lagú amhairc dóthain amharc iarmharach chun siúl thart leo féin

source: Other people may require a mobility aid such as a long cane which will help the person to find a safe way in front of them
ga: Tharlódh go dteastaíonn áis soghluaiseachta ó dhaoine eile, ar nós slat fhada a chabhraíonn leis an duine bealach sábháilte a aimsiú amach rompu

source: Training may involve advising a person with low vision on how to use their residual vision to move around more safely
ga: Is éard a d’fhéadfadh bheith i gceist le hoiliúint ná comhairle a chur ar dhuine ag a bhfuil ísealamharc a n-amharc iarmharach a úsáid chun siúl thart níos sábháilte

source: It may also involve more in-depth training in how to use a mobility aid such as a white cane or a guide dog
ga: Sa mhullach air sin, d’fhéadfadh oiliúint níos doimhne bheith i gceist i dtaca le conas áis soghluaiseachta a úsáid, ar nós slat bhán nó madra treorach

source: Types of mobility aids are described below
ga: Déantar cur síos ar na saghsanna áiseanna soghluaiseachta thíos

source: Two organisations in Ireland provide orientation and mobility training for people with vision impairments the National Council for the Blind in Ireland and Irish Guide Dogs for the Blind
ga: Cuireann dhá eagraíocht in Éirinn oiliúint treoshuímh agus soghluaiseachta ar fáil do dhaoine ar a bhfuil lagú amhairc – Comhairle Náisiúnta na hÉireann do na Daill agus Cumann na hÉireann um Madraí Treorach

source: White canes and walking sticks
ga: Slata bána agus maidí siúil

source: There are three different types of white canes and also a white walking stick available, but only two of the white canes are classed as mobility aids:
ga: Tá trí shaghas de shlata bána ann agus tá fáil ar mhaide bán siúil, ach ní rangaítear ach dhá cheann de na slata bána mar áiseanna soghluaiseachta:

source: • A white walking stick provides physical support for a person and indicates that the individual has sight loss
ga: • Soláthraíonn maide bán siúil tacaíocht fhisiciúil do dhuine agus tugann sé le fios go bhfuil an té a dhéanann é a úsáid thíos le caillteanas amhairc

source: It is not a mobility aid
ga: Ní hionann é agus áis soghluaiseachta

source: • The symbol cane is used to indicate that a person holding it has impaired vision and may need assistance
ga: • Úsáidtear an tslat siombaile le tabhairt le fios go bhfuil amharc lagaithe ag an duine a bhfuil greim beirthe acu uirthi agus go bhféadfadh go dteastaíonn cúnamh uathu

source: It is not a mobility aid and does not provide physical support
ga: Ní hionann í agus áis soghluaiseachta agus ní chuireann sí tacaíocht fhisiciúil ar fáil

source: • The long cane is a mobility device which is used by sweeping the cane in an arc from side to side along the ground beyond the width of their body
ga: • Fearas soghluaiseachta atá sa tslat bhán a úsáidtear tríd an tslat a scuabadh i stua ó thaobh go taobh ar an talamh níos leithne ná leithead a gcoirp

source: This technique locates potential hazards and changes in the texture and level on the ground
ga: Déanann an teicníc seo rudaí a d’fhéadfadh bheith baolach mar aon le hathruithe ar dhromchla agus ar leibhéal na talún a aimsiú

source: Use of the long cane requires training
ga: Chun an tslat fhada a úsáid, teastaíonn oiliúint

source: • The guide cane is a mobility aid with more limited use than a long cane and, therefore, requires less training
ga: • Áis soghluaiseachta atá sa tslat treorach ag a bhfuil úsáid níos teoranta ná slat fhada agus, ar an ábhar sin, ní theastaíonn an oiread céanna oiliúna

source: It can be used in a diagonal position across the lower part of the body for protection or using a scanning technique to detect kerbs and steps
ga: Féadtar í a úsáid i suíomh trasnánach thar an gcuid íochtarach den chorp ar mhaithe leis an gcorp a chosaint nó trí theicníc scanta a úsáid chun colbhaí agus céimeanna a aimsiú

source: It does not provide physical support
ga: Ní chuireann sí tacaíocht fhisiciúil ar fáil

source: In Ireland only certain breeds of dogs can become guide dogs
ga: In Éirinn, ní dhéantar madraí treorach ach de roinnt pórtha de mhadraí

source: The main breeds are labradors and golden retrievers, and crosses of these breeds
ga: Is iad na príomhphórtha labradóir agus aimseadóirí buí, agus crosálaigh de na pórtha seo

source: Dogs that become guide dogs are only bred by Irish Guide Dogs for the Blind
ga: Ní dhéanann ach Madraí Treorach na hÉireann do na Daill madraí as a ndéantar madraí treorach a phórú

source: Pups are fostered by families for twelve months and are then returned to the Irish Guide Dogs for the Blind to train for an eight month period
ga: Déanann teaghlaigh na coileáin a altramú ar feadh dhá mhí dhéag agus ansin tugtar ar ais iad do Mhadraí Treorach na hÉireann do na Daill le hoiliúint a chur orthu ar feadh tréimhse ocht mí

source: It is not possible to have a family pet or puppy trained to be a guide dog
ga: Ní féidir peata teaghlaigh nó coileán a bheith oilte chun feidhmiú mar mhadra treorach

source: The National Council for the Blind in Ireland (NCBI) provides orientation and mobility training service which shows a person with a vision impairment how to move about safely indoors and outdoors
ga: Cuireann Comhairle Náisiúnta na hÉireann do na Daill (NCBI) seirbhís oiliúna treoshuímh agus soghluaiseachta ar fáil a thaispeánann do dhuine ar a bhfuil lagú amhairc conas siúl thart go sábháilte laistigh agus lasmuigh

source: It may involve building up a person’s confidence to walk down their garden, go to their local shop, travel on public transport or through crowded streets, traffic or country roads
ga: B’fhéidir gur gá cur le muinín duine chun siúl a ngairdín síos, chun dul chuig a siopa áitiúil, chun taisteal ar iompar poiblí nó trí shráideanna ina bhfuil go leor daoine, tráchta nó ar bhóithre tuaithe

source: Trainers develop individual mobility programmes which may involve
ga: Déanann oiliúnóirí cláir aonair shoghluaiseachta a fhorbairt a bhféadfadh an méid a leanas bheith i gceist leo:

source: • Teaching a person to maximise use of residual vision
ga: • A mhúineadh do dhuine conas an úsáid a bhaintear as amharc iarmharach a uasmhéadú

source: • Body spatial and environmental awareness
ga: • Feasacht ar spásúlacht an choirp agus na timpeallachta

source: • Orientation and mobility skills within the home, work, college or other everyday routes the person would like to become familiar with
ga: • Scileanna treoshuímh agus soghluaiseachta laistigh den teach, obair, coláiste nó ar bhealaí eile a théann an duine gach lá agus ar mian leo dul i dtaithí orthu

source: • Road safety awareness and independent travel skills
ga: • Feasacht ar shábháilteacht ar bhóithre agus scileanna neamhspleácha taistil

source: Training is also available for sighted relatives and friends of people with vision impairments as to how to guide them effectively
ga: Anuas air sin, tá fáil ar oiliúint le haghaidh gaolta agus cairde lánamhairc le daoine atá thíos le lagú amhairc maidir le conas iad a threorú go héifeachtach

source: The NCBI also provide training in life skills for people with vision impairments
ga: Sa bhreis air sin, soláthraíonn an NCBI oiliúint ar scileanna saoil do dhaoine atá thíos le lagú amhairc

source: Irish Guide Dogs for the Blind offer two kinds of aids to people with vision impairments: guide dogs and long canes
ga: Cuireann Madraí Treorach na hÉireann do na Daill dhá shaghas áiseanna ar fáil do dhaoine atá thíos le lagú amhairc: madraí treorach agus slata fada

source: There is no upper age limit for training with a guide dog but you must be over 18 years of age to apply
ga: Níl aon uasteorainn aoise chun oiliúint a fháil le madra treorach ach ní mór duit bheith os cionn 18 mbliana d’aois chun iarratas a dhéanamh

source: There is a three to four week residential training course
ga: Tá cúrsa oiliúna cónaithe ann a mhaireann idir trí agus ceithre seachtaine

source: When training is complete the trainee returns home with the guide dog and an instructor will call in to help with the ‘settling in process’
ga: Nuair a bhíonn an oiliúint críochnaithe, filleann an t-oiliúnaí ar an mbaile leis an madra treorach agus tabharfaidh teagascóir cuairt air/uirthi chun cabhrú leis an ‘bpróiseas um dhul i dtaithí’

source: Regular contact and support are maintained afterwards between the trainee and the instructor
ga: Coimeádtar teagmháil agus tacaíocht rialta ina dhiaidh sin idir an t-oiliúnaí agus an t-oiliúnóir

source: NCBI do not charge for mobility training and they will supply two long canes per year free of charge
ga: Ní ghearrann an NCBI aon táille as oiliúint soghluaiseachta agus soláthróidh siad dhá shlat fhada sa bhliain saor in aisce

source: Symbol canes and white walking sticks are also available free of charge
ga: Anuas air sin, tá fáil ar shlata siombaile agus maidí bána siúil saor in aisce

source: Irish Guide Dogs for the Blind do not charge for training courses or equipment
ga: Ní ghearrann Madraí Treorach na hÉireann do na Daill aon táille ar chúrsaí oiliúna nó ar threalamh

source: A fee of €10 per week for board and lodging is payable for those on residential training courses
ga: Tá táille €10 sa tseachtain iníoctha le haghaidh béilí agus cóiríochta dóibh siúd ar chúrsaí oiliúna cónaithe

source: A monthly guide dog feeding allowance is available to guide dog owners should they need it
ga: Tá fáil ar liúntas míosúil madra treorach d’úinéirí madra treorach sa chás go dteastaíonn sé

source: Where you maintain a trained guide dog supplied by the Irish Guide Dogs for the Blind, a Guide Dog Allowance may be claimed and after the first claim this is given as a tax credit in your annual certificate of Tax Credits
ga: Sa chás go gcoimeádann tú madra oilte treorach, a sholáthair Madraí Treorach na hÉireann do na Daill, féadtar Liúntas Madra Treorach a éileamh, agus i ndiaidh an chéid éilimh, tugtar seo mar chreidmheas cánach i do dheimhniú bliantúil Creidmheasanna Cánach

source: A letter from Irish Guide Dogs for the Blind confirming that you are a registered owner of a guide dog is required when claiming the relief
ga: Teastaíonn litir ó Mhadraí Treorach na hÉireann do na Daill ina ndearbhaítear gurb úinéir cláraithe madra treorach thú nuair a dhéantar an faoiseamh a éileamh

source: The NCBI has a network of rehabilitation and community resource workers
ga: Tá ag an NCBI líonra d’oibrithe athshlánúcháin agus acmhainní pobail

source: If you would like to use the services of the NCBI you can contact your local community resource worker
ga: Más maith leat seirbhísí an NCBI a úsáid, féadfaidh tú teagmháil a dhéanamh le d’oibrí áitiúil acmhainní pobail

source: If you ring the head office of the NCBI they will give you contact details for your local community resource worker
ga: Má chuireann tú glao ar cheannoifig an NCBI, tabharfaidh siad sonraí teagmhála d’oibrí áitiúil acmhainní pobail duit

source: The community resource worker will then refer you to your local mobility specialist
ga: Déanfaidh an t-oibrí acmhainní pobail ansin thú a atreorú chuig do speisialtóir áitiúil soghluaiseachta

source: The local mobility specialist will call out to consult on types of training and routes you would like to learn
ga: Tabharfaidh an speisialtóir áitiúil soghluaiseachta cuairt ort chun dul i gcomhairle leat faoi na saghsanna oiliúna agus bealaí ar mian leat foghlaim

source: You can apply to Irish Guide Dogs for the Blind yourself or through your family doctor or GP
ga: Féadfaidh tú iarratas a dhéanamh ar Mhadraí Treorach na hÉireann do na Daill tú féin nó trí do dhochtúir teaghlaigh nó trí do LG

source: The Irish Guide Dogs for the Blind will supply you with an information pack and an application form
ga: Soláthróidh Madraí Treorach na hÉireann do na Daill pacáiste faisnéise agus foirm iarratais duit

source: The application form needs to be returned to the Irish Guide Dogs for the Blind along with a medical report from your doctor confirming your vision impairment
ga: Is gá an fhoirm iarratais seo a sheoladh ar ais go dtí Madraí Treorach na hÉireann do na Daill, mar aon le tuairisc leighis ó do dhochtúir ina ndearbhaítear do lagú amhairc

source: A qualified instructor will then visit your home to discuss the types of training available
ga: Ansin tabharfaidh teagascóir cáilithe cuairt ar do theach chun na saghsanna oiliúna atá ar fáil a phlé
